cask_args appdir: '/Applications'

brew 'ack'
#brew 'ansible'
brew 'awscli'
brew 'boot-clj'
brew 'ctags'
brew 'cmake'
brew 'coffeescript'
brew 'curl'
#brew 'doxygen'
#brew 'emacs', args: ['with-cocoa', 'with-modules', 'with-gnutls', 'with-rsvg', 'with-imagemagick']
brew 'gist'
brew 'git'
brew 'git-crypt'
brew 'git-delta'
brew 'global'
brew 'go-jira'
brew 'gnupg2'
brew 'graphviz'
brew 'groovy'
#brew 'heroku-toolbelt'
brew 'hub'
brew 'htop-osx'
brew 'jq'
brew 'imagemagick@6'
brew 'leiningen'
brew 'libxml2'
brew 'macvim'
#brew 'mutt'
brew 'node'
brew 'n'
brew 'openssl'
brew 'postgresql'
#brew 'phantomjs'
brew 'pigz'
brew 'pyenv'
brew 'pyenv-virtualenv'
#brew 'reattach-to-user-namespace'
#brew 'redis'
brew 'ripgrep'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'stern'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
#brew 'tmux-cssh'
brew 'wget'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-binstubs'
brew 'rbenv-default-gems'

tap 'raggi/ale'
brew 'openssl-osx-ca'

#tap 'caskroom/cask'
#tap 'caskroom/versions'
tap 'd12frosted/emacs-plus'

#cask 'arduino'
#cask 'atom'
#cask 'audacity'
cask 'adoptopenjdk'
#cask 'basictex'
#cask 'bowtie'
cask 'charles'
cask 'clipy'
#cask 'colloquy'
cask 'dash'
cask 'diffmerge'
cask 'docker'
cask 'emacs'
#cask 'emacs-plus'
cask 'hammerspoon'
#cask 'hipchat'
#cask 'intellij-idea-ce'
cask 'iterm2'
#cask 'jd-gui'
#cask 'joinme'
cask 'karabiner-elements'
cask 'kindle'
cask 'lastfm'
#cask 'minikube'
cask 'postman'
#cask 'seil'
cask 'send-to-kindle'
#cask 'sketch'
#cask 'skype'
#cask 'snagit'
#cask 'spotify'
#cask 'texmaker'
cask 'the-unarchiver'
#cask 'virtualbox'
#cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'zeplin'
