cask_args appdir: '/Applications'

brew 'ack'
brew 'ansible'
brew 'awscli'
brew 'boot-clj'
brew 'ctags'
brew 'cmake'
brew 'coffeescript'
brew 'curl'
brew 'doxygen'
brew 'emacs'
brew 'gist'
brew 'git'
brew 'git-crypt'
brew 'global', args: ['with-pygments', 'with-ctags']
brew 'gnupg2'
brew 'graphviz'
brew 'groovy'
#brew 'heroku-toolbelt'
brew 'hub'
brew 'htop-osx'
brew 'jq'
#brew 'imagemagick'
brew 'leiningen'
brew 'macvim'
#brew 'mutt'
brew 'node'
brew 'openssl'
brew 'postgresql', args: ['with-python']
#brew 'phantomjs'
brew 'pigz'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tmux-cssh'
brew 'wget'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-binstubs'
brew 'rbenv-default-gems'

tap 'caskroom/cask'
tap 'caskroom/versions'

#cask 'arduino'
#cask 'atom'
#cask 'audacity'
cask 'basictex'
cask 'bowtie'
cask 'clipy'
#cask 'colloquy'
cask 'diffmerge'
cask 'docker'
cask 'hammerspoon'
#cask 'hipchat'
#cask 'intellij-idea-ce'
cask 'iterm2'
#cask 'jd-gui'
#cask 'joinme'
cask 'karabiner-elements'
cask 'kindle'
cask 'minikube'
cask 'postman'
#cask 'seil'
#cask 'send-to-kindle'
#cask 'sketch'
cask 'skype'
#cask 'snagit'
#cask 'spotify'
cask 'texmaker'
cask 'the-unarchiver'
cask 'virtualbox'
#cask 'vagrant'
cask 'vlc'
