cask_args appdir: '/Applications'

brew 'ack'
brew 'ansible'
brew 'awscli'
brew 'boot-clj'
brew 'ctags'
brew 'cmake'
brew 'curl'
brew 'doxygen'
brew 'emacs'
brew 'gist'
brew 'git'
brew 'git-crypt'
brew 'gnupg2'
brew 'graphviz'
brew 'groovy'
brew 'heroku-toolbelt'
brew 'hub'
brew 'htop-osx'
brew 'jq'
brew 'imagemagick'
brew 'macvim'
brew 'mutt'
brew 'node'
brew 'openssl'
brew 'postgresql', args: ['with-python']
brew 'phantomjs'
brew 'pyenv'
brew 'pyenv=virtualenv'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tmux-cssh'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-binstubs'
brew 'rbenv-default-gems'

tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'arduino'
cask 'atom'
cask 'audacity'
cask 'basictex'
cask 'bowtie'
cask 'clipmenu'
cask 'colloquy'
cask 'diffmerge'
# cask 'docker'
cask 'hammerspoon'
cask 'hipchat'
cask 'intellij-idea-ce'
cask 'jd-gui'
cask 'joinme'
cask 'kindle'
cask 'minikube'
cask 'postman'
cask 'seil'
cask 'send-to-kindle'
cask 'sketch'
cask 'skype'
cask 'snagit'
cask 'spotify'
cask 'texmaker'
cask 'the-unarchiver'
cask 'virtualbox'
cask 'vagrant'
cask 'vlc'
